docs/idea.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-02-25 Sun 13:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Adaptive shrinkage via unconstrained optimization</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Abhishek Sarkar">
<link href="https://maxcdn.bootstrapcdn.com/bootswatch/3.3.7/cosmo/bootstrap.min.css" rel="stylesheet" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Adaptive shrinkage via unconstrained optimization</h1>

<div id="outline-container-orgd41bc75" class="outline-2">
<h2 id="orgd41bc75">Introduction</h2>
<div class="outline-text-2" id="text-orgd41bc75">
<p>
<code>ash</code> relies on optimization of the following objective:
</p>

<p>
\[ \pi^* = \arg\max_\pi \sum_j \ln \sum_k \pi_k p(x \mid \sigma^2_k, \cdot) \]
</p>

<p>
where \(\pi\) is constrained to the probability simplex.
</p>

<p>
<a href="https://link.springer.com/article/10.1023/A:1007558615313">Mackay 1998</a> suggests that a change of basis to the <i>softmax basis</i> may make
the problem easier:
</p>

<p>
\[ \pi_j = \frac{\exp(\alpha_j)}{\sum_k \exp(\alpha_k)} \]
</p>

<p>
where \(\alpha_j\) are unconstrained reals.
</p>
</div>
</div>

<div id="outline-container-org13d68af" class="outline-2">
<h2 id="org13d68af">Implementation</h2>
<div class="outline-text-2" id="text-org13d68af">
<p>
For simplicity, assume:
</p>

<ol class="org-ol">
<li>The likelihood is Gaussian</li>
<li>The prior is a scale mixture of Gaussians, with the default grid of scales
as in <a href="https://academic.oup.com/biostatistics/article/18/2/275/2557030">Stephens 2016</a>.</li>
</ol>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">def</span> <span class="org-function-name">softmax</span>(logits):
  <span class="org-variable-name">shifted</span> = np.exp(logits - logits.<span class="org-builtin">max</span>())
  <span class="org-keyword">return</span> shifted / shifted.<span class="org-builtin">sum</span>()

<span class="org-keyword">def</span> <span class="org-function-name">loss</span>(logits, llik):
  <span class="org-keyword">return</span> (llik * softmax(logits)).mean()

<span class="org-keyword">def</span> <span class="org-function-name">ash</span>(beta, se, grid=<span class="org-constant">None</span>):
  <span class="org-keyword">if</span> grid <span class="org-keyword">is</span> <span class="org-constant">None</span>:
    <span class="org-variable-name">start</span> = se.<span class="org-builtin">min</span>() / 10
    <span class="org-variable-name">m</span> = <span class="org-builtin">max</span>(beta - se)
    <span class="org-keyword">if</span> m &lt; 0:
      <span class="org-variable-name">end</span> = 8 * start
    <span class="org-keyword">else</span>:
      <span class="org-variable-name">end</span> = 2 * np.sqrt(m)
    <span class="org-variable-name">grid</span> = np.logspace(start, end, base=np.sqrt(2))
  <span class="org-keyword">assert</span> <span class="org-builtin">len</span>(grid.shape) == 1
  <span class="org-keyword">assert</span> (grid &gt; 0).<span class="org-builtin">all</span>()
  <span class="org-variable-name">var</span> = se.reshape(-1, 1) + grid.reshape(1, -1)
  <span class="org-comment-delimiter"># </span><span class="org-comment">Negative log-likelihood since we're going to minimize</span>
  <span class="org-variable-name">llik</span> = .5 * (np.log(2 * np.pi * var) + np.square(beta).reshape(-1, 1) / var)
  <span class="org-variable-name">logits</span> = np.zeros(grid.shape)
  <span class="org-variable-name">res</span> = so.minimize(loss, logits, args=(llik,))
  <span class="org-keyword">if</span> res.success:
    <span class="org-keyword">return</span> softmax(res.x)
  <span class="org-keyword">else</span>:
    <span class="org-keyword">raise</span> <span class="org-type">ValueError</span>(res.message)
</pre>
</div>

<p>
Simulate some data, fixing \(\hat{s}_j = 1\) for all \(j\).
</p>

<p>
\[ x \mid z = 1 \sim \sum_k \pi_k N(0, \sigma^2_k) \]
\[ \hat{x} \sim N(x, 1) \]
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">def</span> <span class="org-function-name">simulate</span>(n, pi0, logits=<span class="org-constant">None</span>, grid=<span class="org-constant">None</span>):
  <span class="org-keyword">assert</span> np.isscalar(pi0)
  <span class="org-keyword">assert</span> 0 &lt; pi0 &lt; 1
  <span class="org-keyword">if</span> grid <span class="org-keyword">is</span> <span class="org-constant">None</span>:
    <span class="org-variable-name">grid</span> = np.geomspace(.1, 1, 3)
  <span class="org-keyword">assert</span> <span class="org-builtin">len</span>(grid.shape) == 1
  <span class="org-keyword">assert</span> (grid &gt; 0).<span class="org-builtin">all</span>()
  <span class="org-keyword">if</span> logits <span class="org-keyword">is</span> <span class="org-constant">None</span>:
    <span class="org-variable-name">logits</span> = np.ones(grid.shape)
  <span class="org-keyword">assert</span> logits.shape == grid.shape
  <span class="org-variable-name">x</span> = np.random.normal(loc=np.random.normal(scale=np.random.choice(grid, p=softmax(logits), size=n)))
  <span class="org-variable-name">z</span> = np.random.uniform(size=n) &gt; pi0
  <span class="org-keyword">return</span> x * z
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">n</span> = 1000
<span class="org-variable-name">betahat</span> = simulate(n=n, pi0=.75)
ash(betahat, np.ones(n))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">betahat</span> = simulate(n=100000, pi0=.75)
<span class="org-variable-name">s</span> = np.ones(100000)
%timeit ash(betahat, s)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhishek Sarkar</p>
<p class="date">Created: 2018-02-25 Sun 13:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
